---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningDoesnotCutHostDelete
source: html/55ac7a78-6f8c-b9f1-955d-f8f3a071505c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningDoesnotCutHostDelete Property

Opening does not cut its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId OpeningDoesnotCutHostDelete { get; }
```